DataProcessors/НастройкаРасписанияРаботыКаналов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>НастройкаРасписанияРаботыКаналов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Catalogs/ТелВнешние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ТелВнешние</Name>
			<Comment>Внешние телефоны</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер, на который поступает данный номер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГорода</Name>
					<Comment>Телефонный код города</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Comment>Провайдер телефонного номера</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Сведения о предназначении номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактЦентр</Name>
					<Comment>Контакт-центр для обработки непринятых звонков</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаИспользоватьЭтотКЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИсходящие</Name>
					<Comment>Телефон может использоваться для совершения исходящих вызовов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Адрес эл. почты уведомления о пропущенном</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Варианты</Name>
					<Comment>Варианты написания телефонного номера</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Comment>Вариант написания номера</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
					<Comment>Распределение трафика по очередям</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактЦентр</Name>
							<Comment>Контакт-центр получивший трафик с номера</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Comment>Рекомендованная очередь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/НастройкаРасписанияРаботыКаналов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВыбраннаяДата  	= ТекущаяДата();
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("CurrentDate", 	ВыбраннаяДата);
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДеньНедели", 		Строка(ДеньНедели(ВыбраннаяДата)));
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПОДСТРОКА(Код, 2,ДлинаСтроки(Код)-1) ИЗ Справочник.ТелВнешние ГДЕ Архивный = ИСТИНА");
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("АрхивныеКаналы",РезультатЗапроса.Выгрузить().ВыгрузитьКолонку(0));	
	КонецЕсли;
 КонецПроцедуры

#Область Редактировать_расписание
&НаКлиенте
Процедура СпВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекДанные = ЭтаФорма.Элементы.Сп.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.schedules_names_restricted <> 0 Тогда
		Сообщить("Это расписание настраивать нельзя!");
		Возврат;
	КонецЕсли;
	
	Оп = Новый ОписаниеОповещения("РедактированиеРасписания_Окончание", ЭтаФорма, "");
	Парам = Новый Структура();
	Парам.Вставить("Ключ", ТекДанные.incoming_routes_Ссылка);
	ОткрытьФорму( "Обработка.НастройкаРасписанияРаботыКаналов.Форма.ФормаНастройкиРасписания", Парам, ЭтаФорма,,,,Оп, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура РедактированиеРасписания_Окончание(Парам1, Парам2) Экспорт
	Элементы.Сп.Обновить();
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ВыбраннаяДатаПриИзменении(Элемент)
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("CurrentDate", ЭтаФорма.ВыбраннаяДата);
	Сп.КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДеньНедели", 	Строка(ДеньНедели(ВыбраннаяДата)));
КонецПроцедуры
